EXPRESSION_MEANS = {
    'Аллитерация': 'Один из видов звукописи, повторение в тексте созвучных или одинаковых согласных звуков. ',
    'Ассонанс': 'Один из видов звукописи, повторение в тексте одинаковых гласных звуков.',
    'Аллегория': 'Cложная устойчивая метафора, прижившаяся в определенной культуре. Например, в России смерть '
                 'ассоциируется со старухой с косой, а в Германии – со стариком.\n\nАллегория очень важна для писателя, '
                 'поскольку она однозначно понимаема. Например, насквозь аллегоричны сказки и басни, поэтому стоит '
                 'нам сравнить своего героя с каким-то персонажем (зайцем, лисой, медведем), читатель без комментариев '
                 'поймет, что мы имеем в виду.\n\nС такими же целями мы можем использовать имена героев из известных '
                 'фильмов или просто имена известных людей. Этот прием очень популярен, у него есть свое название '
                 '(антономазия), его можно рассмотреть и самостоятельно, и метонимически, и аллегорически. '
                 'Об аллегории можно говорить в том случае, если имя собственное стало общеизвестным культурным '
                 'знаком. Если мы про кого-то скажем, что он метит в Наполеоны, мы дадим исчерпывающую информацию '
                 'о его политических целях.',
    'Гипербола': 'Явное преувеличение.\n\nГипербола призвана подчеркнуть какой-то признак, обратить на него внимание.\n\n'
                 'Очень часто для этого используются «готовые» гиперболы, речевые штампы и фразеологизмы: '
                 '\n«Этими обещаниями нас кормят уже тысячу лет»;\n«Люди здесь каждую секунду хватаются за телефоны '
                 'и названивают близким».\n\n'
                 'Однако штампы, разумеется, не единственный и не самый выразительный вид гипербол. '
                 'Классические образцы гиперболизации можно найти в художественной литературе и фольклоре.\n\n'
                 'Гипербола является одним из наиболее популярных художественных приемов. '
                 'Талантливый художник способен создавать неожиданные, выразительные гиперболы, '
                 'проникнутые глубоким психологизмом.',
    'Ирония': 'Троп, образованный за счет того, что сказанная фраза в данном контексте или благодаря данной интонации '
              'означает свою противоположность или, во всяком случае, теряет однозначность.\n\nЕсли мы слушаем не очень '
              'умную речь, мы можем сказать с определенной интонацией: «Какое это было замечательное и умное '
              'выступление!», и нас поймут так, что мы выступлением недовольны.\n\n'
              'В живой речи ирония чаще всего подчеркивается:\n- характерной интонацией;\n- изменением порядка слов '
              '(в русском языке фраза «Мне это очень нужно» будет воспринята в прямом смысле, '
              'а «Очень мне это нужно» – в ироническом);\n- заведомым искажением или неточным употреблением грамматических'
              ' форм: «Распрекраснейшая вы наша!», «Надо было сказать еще красимше».\n\nСуществуют и другие возможности '
              'показать слушателям или читателям, что вы иронизируете. '
              'Тонкая ирония – обязательный атрибут умелого писателя. Ирония может возникать также за счет '
              'использования необходимого контекста.',
    'Лексический повтор': 'Повторение в тексте одного и того же слова, словосочетания.\n\nРиторическое значение такого '
                          'повтора огромно. Человек устроен так, что повторенному несколько раз действию он верит '
                          'больше, чем действию, про которое сказано, что оно сильное. Например, фраза «Я его ненавижу, '
                          'ненавижу, ненавижу» произведет больший эффект, чем «Я очень сильно его ненавижу».\n\n'
                          'Художественная роль повтора также огромна. И прозаическая, и особенно поэтическая художественная '
                          'речь с древнейших времен изобилует повторами, эстетическое воздействие повторов люди оценили '
                          'на самой заре искусства. Повторами полны и фольклорные тексты, и современная поэзия.\n\n'
                          'Повторенное слово или повторенная конструкция не просто «раскачивает» эмоцию, но приводит '
                          'к некоторому замедлению речи, позволяя сосредоточиться на опорном и важном слове. В этом '
                          'смысле повтор связан с другим важным поэтическим приемом – ретардацией (искусственным '
                          'замедлением речи). Ретардация может достигаться разными способами, повтор – самый простой '
                          'и известный.',
    'Литота': 'Метафора, основанная на заведомом преуменьшении чего-либо.\n\n Это своеобразная гипербола наоборот. '
              'Однако, как правило, оппозиция «литота – гипербола» имеет смысл только в пространственных образах: '
              '«человек-гора» – гипербола, «мальчик-с-пальчик» – литота. За пределами этого литота '
              'и гипербола сливаются. «Сущий дьявол» и «сущий ангел»; «у него денег куры не клюют» '
              'и «у него денег ни гроша» нельзя рассматривать как оппозицию «гипербола–литота». Это просто гиперболы.',
    'Метафора': 'Переносное значение слова, основанное на сходстве. Скрытое сравнение, построенное по схеме '
                '«А вместо В». \n\nМожно сказать: «Когда же придет наш приятель, огромный, как слон?» Это будет сравнение. '
                'Но можно сразу сказать: «Когда наш слон придет?» Это метафора. \n\nЧасто метафору можно «восстановить» '
                'в сравнение, т. е. добавить пропущенную часть, однако это не всегда возможно. \n\nМетафор очень много, '
                'чаще всего они так и называются – «метафоры», не имея особых названий для каждого вида. Но некоторые,'
                ' наиболее характерные метафоры, получили свое терминологическое определение: олицетворение, гипербола,'
                'литота, аллегория.\nМетафора может быть простой, состоящей из одного выражения, '
                'употребленного в переносном значении (вместо улей - "келья восковая"), и развернутой.',
    'Метонимия': 'Троп, основанный на общей ситуации, которая может в реальности быть очень разной:\n- общее место '
                 '(«весь автобус захохотал»),\n- форма и содержание («я выпил уже две чашки»),\n- имя и то, что им называется'
                 ' («я выхожу на Горького» (вместо «я выхожу на улице имени Горького»),\n- автор и его произведение '
                 '(«Пушкин стоит на верхней полке») и т. д.\n\nКак правило, метонимия более привязана к контексту, '
                 'чем метафора, более зависима от традиции употребления. Особенно это касается так называемых '
                 'эллиптических метонимий, то есть образованных путем пропуска части текста.\nСкажем, '
                 '«Я люблю Достоевского» вместо «Я люблю произведения Достоевского». Даже в близких ситуациях '
                 'в одном случае фраза покажется нормальной, в другом – нарочито ошибочной. Возможно сказать: '
                 '«Я люблю Пушкина» (стихи Пушкина). Но абсурдно: «В Пушкине хорошо изображена любовь».\n'
                 'Метафора таких границ словоупотребления, как правило, не имеет.',
    'Олицетворение': 'Перенесение свойств человека на неодушевлённые предметы.\n\n'
                     'При этом выпускается часть «как если бы он/она был(а) человеком»: «дождь плачет», «часы спешат», '
                     '«дерево грустит».\n\n'
                     'Олицетворение – душа поэзии. Человеческое сознание вообще склонно везде «искать человека», '
                     'проецировать человеческое на весь космос. А литература и вовсе везде ищет человека, '
                     'это ее главный предмет и забота.',
    'Окказионализмы': 'Слова, не зафиксированные в языковой норме и созданные специально «под данный случай».\n\n'
                      'Роль окказиональных слов особенно возрастает в литературе ХХ века в связи с общей тенденцией к '
                      'словотворчеству. Достаточно вспомнить окказионализмы В. Маяковского («двухметроворостая»), '
                      'И. Северянина («дорожка олуненная»), В. Набокова («дом безлолитен»). \n\nВ ряде случаев поэтические '
                      'окказионализмы приживаются в языке и со временем становятся общеупотребительными. Например, '
                      'едва ли современный русский человек задумывается, что слово «летчик» имеет поэтическое '
                      'происхождение, его создал, по устоявшейся легенде, поэт В. Хлебников.\n\nОднако чаще всего '
                      'окказионализмы остаются только в тех текстах, ради которых они были созданы.',
    'Перифраз': 'Синтактико-семантическая фигура, состоящая в замене однословного наименования предмета или действия '
                'описательным многословным выражением.\n\nРазличают несколько типов перифраза:\n\nI. Как фигура грамматическая:'
                '\nа) свойство предмета берется как управляющее слово, название же предмета берется как слово управляемое:'
                ' «Поэт бывало тешил ханов стихов гремучим жемчугом» (перифраз слова «стихами»);'
                '\nб) глагол заменяется существительным, образованным от той же основы с другим (вспомогательным) глаголом: '
                '«совершается обмен» вместо «обменивается». \n\nII. Как фигура стилистическая: \nв) название предмета '
                'заменяется описательным выражением, являющимся развернутым тропом (метафорой, метонимией и т. п.): '
                '«пришли мне, выражаясь языком Делиля, витую сталь, пронзающую засмоленную главу бутылки, '
                'т. е. штопор» (письмо Пушкина к брату).',
    'Сарказм': 'Наиболее жестким и откровенным случаем иронии, всегда обличительным, является сарказм '
               '– подчеркнутая злая насмешка.',
    'Синекдоха': 'Метонимия, основанная на отношениях целого и части:\n «Я занял очередь за красной сумкой», '
                 '«Здорово, борода!»,\n«Этот политик совершенно изжил себя, ему остается надеяться только на помощь '
                 'штыков».\n\n В отличие от метафоры, синекдоха имеет логические ограничения употребления, что вообще '
                 'свойственно для метонимий. Например, Н. Д. Арутюнова справедливо '
                 'замечает: «Синекдоха неупотребительна <…> в бытийных предложениях и их эквивалентах, вводящих '
                 'некоторый предмет в мир повествования. Так, нельзя начать рассказ словами «Жила-была (одна) красная '
                 'шапочка». Такое употребление воспринимается как олицетворение некоторого предмета, '
                 'а не как обозначение лица». \n\nКроме того, для синекдохи не характерна предикативность '
                 '(то есть она редко встречается в позиции сказуемого). Если же это происходит, синекдоха '
                 'почти всегда приобретает метафорический оттенок, становясь характеристикой героя.',
    'Сравнение': 'Сопоставление двух предметов, понятий или состояний, имеющих общий признак.\n\n '
                 'Существует несколько видов сравнений:\n\n '
                 '- cоюзное сравнение - сравнение с использованием союзов как, словно, будто.\n\n ' 
                 '- грамматическое сравнение выражено в форме подлежащего и сказуемого без союза.\n\n'
                 '- простое сравнение выражено с помощью творительного падежа.\n\n'
                 '- отрицательное сравнение организовано по схеме «это не А, а Б».',
    'Эпитет': 'Образное определение, характеризующее свойство, качество, понятие, явление.\nБывает двух видов: '
              'метафорический и метонимический. \n\nМетафорическим он становится тогда, когда в основе явно прослеживается '
              'метафора или сравнение: «русалочьи глаза» (как у русалки), лисьи повадки (если сказано о человеке). '
              '\n\nМетонимический эпитет основан на метонимии. Например, «дозорные костры» (костры, которые разожгли те, '
              'кто в дозоре), «сумасшедший дом» (дом, где содержатся умалишенные).',
    'Анафора': 'Повторение звуков, слова или группы слов в начале предложения, законченного абзаца '
               '(в стихотворной речи – строфы или строки).\n\n'
               '«Мой долг мне ясен. Мой долг – делать мое дело. Мой долг – быть честным. Мой долг я исполню».'
               '\n\nВ прозаической речи, произносимой вслух, анафора позволяет усиливать эффект от приводимых доказательств'
               'и примеров. Повтор в начале каждого предложения «умножает» значимость аргументов: '
               ' «Именно в этих местах он провел свое детство. Именно здесь он прочел первые книги. '
               'Именно здесь он написал первые строки».',
    'Антитеза': 'Резкое противопоставление чего-либо, подчеркнутое синтаксически.\n\nКлассическим примером антитезы '
                'является пушкинская характеристика отношений Ленского и Онегина: \n\n«Они сошлись. \nВолна и камень. '
                '\nСтихи и проза, \nЛед и пламень».',
    'Градация': 'Такое расположение частей высказывания, относящихся к одному предмету, при котором каждая последующая '
                'часть оказывается более выразительной, чем предыдущая.\n\n «Я не знаю ни страны, ни города, ни улицы, '
                'ни дома, где она живет»;\n\n «Мы готовы возражать, спорить, конфликтовать, воевать!»\n\nИногда градацию '
                'отличают от схожей фигуры «накопление» (повтор с семантическим усилением, скажем, накопление синонимов'
                ' с возрастающей экспрессией). \n\nЧаще сегодня говорят только о градации, объединяя все схожие приемы '
                'этим термином: "В деревню, к тетке, в глушь, в Саратов, там будешь горе горевать".',
    'Инверсия': 'Нарочитое нарушение правильного порядка слов. \n\nВ современной культуре инверсия – норма '
                'поэтической речи. Она не только позволяет оттенить нужные слова, но и радикально расширяет '
                'возможности ритмической пластики речи, то есть делает возможным «вписать» нужное сочетание слов в '
                'заданный ритмический рисунок стиха. \n\nПоэзия почти всегда инверсионна: "Любви, надежды, тихой славы '
                'недолго нежил нас обман…"',
    'Композиционный стык': 'Повторение в начале нового предложения слов из предыдущего предложения, '
                           'обычно заканчивающих его.',
    'Многосоюзие': 'Умышленное увеличение количества союзов в предложении. \n\nПри употреблении этой риторической фигуры '
                   'речь замедляется вынужденными паузами, и подчеркивается роль каждого из слов, а также единство '
                   'перечисляемого. \n\nМногосоюзие является, по сути, частным случаем анафоры: «А дом, а родных, а друзей,'
                   ' а соседей ты не забыл?»',
    'Оксюморон': 'Прием, когда одно понятие определяется через свою невозможность. \nВ результате оба понятия отчасти '
                 'теряют смысл, и образуется новое значение. \n\nОсобенность оксюморона в том, что он всегда провоцирует '
                 'смыслопорождение: читатель, столкнувшись с вопиюще невозможной фразой, начнет «достраивать» смыслы. '
                 '\n\nПисатели и поэты часто пользуются этим приемом, позволяющим сказать о чем-то кратко и емко. '
                 '\n\nВ ряде случаев оксюморон бросается в глаза («Живой труп» Л.Н. Толстого, «Горячий снег» Ю. Бондарева),'
                 ' в других он может быть менее заметен, обнаруживает себя при более вдумчивом прочтении '
                 '(«Мертвые души» Н. В. Гоголя – ведь у души нет смерти, «мертвая зелень ветвей» у пушкинского анчара '
                 '–  ведь зеленая листва у дерева знак жизни, а не смерти). Огромное число оксюморонов мы найдем '
                 'в поэзии А. Блока, А. Ахматовой и других корифеев русской поэзии.',
    'Парцелляция': 'Нарочитое «дробление» синтаксической конструкции на простые элементы, чаще всего с нарушением '
                   'синтаксической нормы.\n\nПарцелляция очень популярна у писателей и поэтов, так как позволяет выделить '
                   'каждое слово, сделать на нем акцент. \n\nНапример, известный рассказ А. Солженицына «Матренин двор»  '
                   'с точки зрения синтаксической нормы должен был бы заканчиваться так: \n«Все мы  жили рядом с ней '
                   'и не поняли,  что есть она тот самый  праведник, без которого, по пословице, не стоит ни село, '
                   'ни город, ни вся земля наша». \n\nНо писатель использует парцелляцию, и фраза становится гораздо '
                   'выразительнее: \n«Все мы  жили рядом с ней и не поняли, что есть она тот самый праведник, '
                   'без которого, по пословице, не стоит село. Ни город. Ни вся земля наша».',
    'Риторический вопрос, восклицание, обращение': 'Риторический вопрос – вопрос, который не требует ответа, но имеет '
                                                   'эмоциональное значение. Часто это утверждение, высказанное в '
                                                   'вопросительной форме. Например, риторический вопрос «И у кого же '
                                                   'нам теперь спросить, что делать?» подразумевает «Теперь нам не '
                                                   'у кого спросить, что делать».\n\n'
                                                   'Термином "риторическое восклицание" обычно называют '
                                                   'восклицание как таковое. При помощи восклицания можно прямо '
                                                   'передать эмоции: «Что это было за время!» Восклицание выражается '
                                                   'интонационно, а также же при помощи междометий и особой структуры '
                                                   'предложения: «О, какие перемены нас ждут!» «Боже мой! И все это '
                                                   'происходит в моем городе!» \n\nРиторическое обращение – условное '
                                                   'обращение к кому-либо в рамках монолога. Это обращение не открывает'
                                                   ' диалога и не требует ответа. В действительности это утверждение '
                                                   'в форме обращения. Так, вместо того, чтобы сказать «Мой город '
                                                   'изуродован» писатель может сказать: «Мой город! '
                                                   'Как тебя изуродовали!» Это делает утверждение более эмоциональным '
                                                   'и личным.',
    'Синтаксический параллелизм': 'Прием, при котором соседние предложения строятся по одинаковой схеме. '
                                  '\n\nСходность таких элементов речи часто обеспечивается анафорой или эпифорой: ',
    'Эллипсис': 'Сокращение, "пропуск" слов, легко восстанавливаемых по смыслу, что способствует динамичности и '
                'сжатости речи.',
    'Эпифора': 'Повторение одних и тех же слов в конце смежных отрезков речи, прием, противоположный анафоре: '
               '«Найти нужное решение и сделать то, что нужно, – вот что главное в их работе. Быстро отреагировать на '
               'ситуацию и не растеряться – вот что главное в их работе. Сделать свою работу и вернуться живыми к '
               'женам – вот что главное в их работе…»',
    'Бессоюзие': 'Такое построение речи, при котором опускаются союзы и соединяющие слова, что придает высказыванию '
                 'динамичность и стремительность, как, например, в пушкинской «Полтаве»: "Швед, русский колет, рубит, '
                 'режет, бой барабанный, клики, скрежет".'
}

EXPRESSION_MEANS_EXAMPLES = {
    'Аллитерация': '"Свищет ветер, серебряный ветер\nВ шёлковом шелесте снежного шума".\n(С. Есенин)\n\n'
                   'Бей, барабан! \nБарабан, барабань!.. \nБарбей! \nБарбань! \nБарабан! \n(В. Маяковский)',
    'Ассонанс': 'У наших ушки на макушке!\n'
                'Чуть утро осветило пушки\n'
                'И леса синие верхушки —\n'
                'Французы тут как тут.\n(М. Ю. Лермонтов)\n\n'
                'О, весна без конца и без краю - \nБез конца и без краю мечта! \n(А. Блок)',
    'Аллегория': 'Прекрасен царскосельский сад, \nГде льва сразив, почил орел России мощной \nНа лоне мира и отрад.'
                 ' \n(лев – Швеция) \n(А. Пушкин)\n\nСады молчат. Унылыми глазами \nС унынием в душе гляжу вокруг; '
                 '\nПоследний лист разметен под ногами, '
                 '\nПоследний лучезарный день потух.\n(осень – уныние) \n(А. А. Фет)',
    'Гипербола': 'У Ивана Никифоровича, напротив того, шаровары в таких широких складках, что если бы раздуть их, '
                 'то в них можно бы поместить весь двор с амбарами и строением. \n(Н. В. Гоголь) '
                 '\n\nСидит лодырь у ворот, \nШироко разинув рот, \nИ никто не разберет, \nГде ворота, а где рот. '
                 '\n(Частушка.)',
    'Ирония': 'Полицмейстер был некоторым образом отец и благотворитель в городе. '
              'Он был среди граждан совершенно как родной в семье, а в лавки и в гостиный двор наведывался, '
              'как в собственную кладовую.\n(Н. В. Гоголь)',
    'Лексический повтор': 'Плыть, плыть, плыть \nМимо могильных плит, \nМимо церковных рам, \nМимо семейных драм... '
                          '\n\nСкучные мысли – прочь! \nДумать и думать – лень! \nЗвезды на небе – ночь! \nСолнце '
                          'на небе – день! '
                          '\n\nПлыть, плыть, плыть \nМимо родной ветлы, \nМимо зовущих нас \nМилых сиротских глаз...'
                          '\n(Н.Рубцов)',
    'Литота': 'Мой Лизочек так уж мал, \nТак уж мал, \nЧто из крыльев комаришки \nСделал две себе манишки.\n(Н.Плещеев)'
              '\n\nМы оба мечик и листовочка, \nмы мальчик-с-пальчик и дюймовочка \nперед безликою толпой, '
              '\nс которою вступаем в бой.\n(А. Ханмагомедов)',
    'Метафора': 'Парадом развернув моих страниц войска, \nя прохожу по строчечному фронту. '
                '\nСтихи стоят свинцово-тяжело, \nготовые и к смерти, и к бессмертной славе. '
                '\nПоэмы замерли, к жерлу прижав \nжерло нацеленных зияющих заглавий.\n(В.Маяковский)\n\n'
                '"Сонное озеро города" \n(А.Блок), \n\n"Сугробов белые телята" \n(Б.Ахмадулина), '
                '\n\n"Костер рябины красной" \n(С.Есенин).',
    'Метонимия': 'Перо его местию дышит. \n(А.К.Толстой) \n\nСюда по новым им волнам, \nВсе флаги в гости будут к нам.'
                 '\n(А.С.Пушкин) \n\nЧитал охотно Апулея,\n А Цицерона не читал.\n(А.С.Пушкин)',
    'Олицетворение': 'Утешится безмолвная печаль, \nИ резвая задумается радость... \n(А.С.Пушкин) '
                     '\n\nЛазурь небесная смеётся, \nНочной омытая грозой, \nИ между гор росисто вьется '
                     '\nДолина светлой полосой. \n(Ф. И. Тютчев)',
    'Окказионализмы': 'Какой, какой тысячекост, \nГрознокрылат, полуморской, '
                      '\nНад морем островом подъемлет хвост, \nПолунеземной объят тоской? \n(В. Хлебников)'
                      '\n\nПоэзия – музей \nзакопанных богов, \nслоновых их костей,  \nбараньих их рогов,'
                      ' \nв которые дудю, \nдудею и дужу, \nкогда молюсь дождю, \nкогда огню служу. \n(В. Полозкова)',
    'Перифраз': 'Летами юный, ветхий славой, \nВеличья русского залог, \nПрости, Петрополь величавый, '
                '\nНевы державный полубог! \n(П. Ершов)'
                '\n\nЛюблю тебя, Петра творенье, \nЛюблю твой строгий, стройный вид, \nНевы державное теченье, '
                '\nБереговой ее гранит… \n(А. С. Пушкин)',
    'Сарказм': 'Славная бекеша у Ивана Ивановича! Описать нельзя: бархат! Серебро! Огонь! Господи боже мой! Чудотворец,'
               ' угодник божий! Отчего же у меня нет такой бекеши!\n(Н. В. Гоголь)'
               '\n\nМолчалин! — Кто другой так мирно все уладит! \nТам моську вовремя погладит, '
               '\nТут в пору карточку вотрет, \nВ нем Загорецкий не умрет. \n(А. С. Грибоедов)',
    'Синекдоха': 'И слышно было до рассвета, как ликовал француз. \n(М.Ю. Лермонтов)'
                 '\n\nПрежняя рыжая голова с бакенбардами снова показалась из-за двери, поглядела и вошла в контору '
                 'вместе со своим довольно некрасивым туловищем. \n(И.С. Тургенев)',
    'Сравнение': '«Как серна гор, пуглив и дик» (Лермонтов) \n«Ты прошла, словно сон мой, легка» (Блок) '
                 '\n\n«Он в этом деле – царь и бог» \n«Его жена – сущий ангел» '
                 '\n\n«Ты сегодня выглядишь орлом» \n«Он хочет выглядеть Соломоном, а выглядит Иваном Дураком»'
                 '\n\n«Не стая черных ястребов спустилась над Германией – фашисты пришли к власти».',
    'Эпитет': 'Льстивые ивы и травы поклонные, вольнолюбивого юношу — славьте.\n(М. Цветаева)\n\n'
              'Закружилась листва золотая \nВ розоватой воде на пруду, \nСловно бабочек легкая стая '
              '\nС замираньем летит на звезду.\n(С. Есенин)',
    'Анафора': 'Блажен, кто смолоду был молод, \nБлажен, кто вовремя созрел… \n(А. Пушкин)'
               '\n\nЛюблю лебедей, \nХолодных и чистых, как Ладога. \nЛюблю лебедей, \nСветящихся белыми лампами. '
               '\nЛюблю лебедей \nЗа лёгкость летящую линий. \nЛюблю лебедей — '
               '\nОни вырастают из лилий. \n(Г. Серебряков)',
    'Антитеза': 'Полюбил богатый — бедную, \nПолюбил учёный — глупую, \nПолюбил румяный — бледную,'
                '\nПолюбил хороший — вредную: \nЗолотой — полушку медную. \n(М. Цветаева)'
                '\n\nПусть светит месяц — ночь темна. \nПусть жизнь приносит людям счастье,'
                '\n — В моей душе любви весна '
                '\nНе сменит бурного ненастья.\n(А. Блок)',
    'Градация': 'Не хочу быть черной крестьянкой, \nХочу быть столбовой дворянкой; \nНе хочу быть столбовой дворянкой,'
                '\nА хочу быть вольной царицей; \nНе хочу быть вольной царицей, \nА хочу быть владычицей морскою. '
                '\n(А. С. Пушкин)\n\nВсе грани чувств, все грани правды стёрты в мирах, в годах, в часах. \n(А. Белый)',
    'Инверсия': 'Пришла она, желанная, пришла благоуханная, \nИз света дня сотканная волшебница-весна. \n(К. Феофонов) '
                '\n\nСегодня у берега нашего бросил свой якорь досель неизвестный корабль. \n(Н. Гумилёв) '
                '\n\nСкоро получишь ответ ты — весточку в несколько строк. \n(В.Высоцкий)',
    'Композиционный стык': 'На заре зорянка запела. Запела и чудом соединила в песне своей все шорохи, шелесты... '
                           '\n(Н.Сладков)\n\nЯ мечтою ловил уходящие тени, \nУходящие тени погасавшего дня, '
                           '\nЯ на башню всходил, и дрожали ступени, \nИ дрожали ступени под ногой у меня. '
                           '\n(К. Бальмонт)',
    'Многосоюзие': 'И ароматы… и движенье, \nИ шум, и блеск, и красота – \nЗелёный бал – воображенья '
                   '\nЕдва рождённая мечта… \n(И. Анненский) \n\nИ солнца поздний пыл в его коротких дугах, '
                   '\nНевластный вылиться в душистые плоды. \nИ жёлтый шёлк ковров, и грубые следы, '
                   '\nИ понятая ложь последнего свиданья, \nИ парков чёрные, бездонные пруды, '
                   '\nДавно готовые для спелого страданья… \n(И. Анненский)',
    'Оксюморон': 'Страдать! Страдают все, страдает тёмный зверь; \nБез упованья, без сознанья, '
                 '\nНо перед ним туда навек закрыта дверь, \nГде радость теплится страданья. \n(А. А. Фет) '
                 '\n\nБеспокойная ласковость взгляда, \nИ поддельная краска ланит, \nИ убогая роскошь наряда — '
                 '\nВсё не в пользу её говорит. \n(Н. А. Некрасов)',
    'Парцелляция': 'А всё Кузнецкий мост, и вечные французы, \nОткуда моды к нам, и авторы, и музы: '
                   '\nГубители карманов и сердец! \nКогда избавит нас творец '
                   '\nОт шляпок их! чепцов! и шпилек! и булавок! \nИ книжных и бисквитных лавок!\n(А. С. Грибоедов)'
                   '\n\n…Но горы близко. \nИ снег на них. Мы время проведем \nУ печки. В Имеретии. Зимою. '
                   '\nКак в Переделкине, как под Москвою. \n(В. Инбер)',
    'Риторический вопрос, восклицание, обращение': 'Знаете ли вы, какое наслаждение выехать весной до зари? Лошади '
                                                   'звучно шлепают ногами по лужам, кучер посвистывает. На темно-сером '
                                                   'небе кое-где мигают звезды, влажный ветерок изредка набегает '
                                                   'волной, слышится сдержанный неясный шепот ночи. (И.С. Тургенев)\n\n'
                                                   'О, дева всех румянее \nСреди зелёных гор — \nГермания! \nГермания! '
                                                   '\nГермания! \nПозор! \n(М. Цветаева) '
                                                   '\n\nА вы, надменные потомки \nИзвестной подлостью прославленных'
                                                   ' отцов, \nПятою рабскою поправшие обломки \nИгрою счастия '
                                                   'обиженных родов! \n(М. Ю. Лермонтов)',
    'Синтаксический параллелизм': 'Но слишком рано твой ударил час, \nИ вещее перо из рук упало. '
                                  '\nКакой светильник разума угас! \nКакое сердце биться перестало! \n(Н. А. Некрасов) '
                                  '\n\nЖизнь без тревог — прекрасный светлый день, \nТревожная — весны младые грезы. '
                                  '\nТам — солнца луч и в зной оливы сень, '
                                  '\nА здесь — и гром, и молния, и слезы… \n(А. Майков)',
    'Эллипсис': 'Вы — с отрыжками, я — с книжками, \nВы — с трюфелем, я — с грифелем, \nВы — с оливками, я — с рифмами,'
                '\nВы — с пикулем, я — с дактилем. \n(М. Цветаева) \n\nПривольем пахнет дикий мёд, '
                '\nПыль — солнечным лучом, \nФиалкою — девичий рот, \nА золото — ничем. \n(А. Ахматова)',
    'Эпифора': 'Силы даны мне судьбой, \nУдача дана мне судьбой, \nИ неудача — судьбой; \nВсё в мире вершится судьбою.'
               '\n(М. Гаспаров)\n\nПервое слово ребенок сказал: \n— Мама!\nВырос. Солдатом пришел на вокзал. \n— Мама! '
               '\nВот в атаке на дымную землю упал. \n— Мама! \nВстал. И пошёл. И губами к жизни припал. \n— Мама! '
               '\n(С. Островой)',
    'Бессоюзие': 'День вечереет, небо опустело, \nГул молотилки слышен на гумне... \nЯ вижу, слышу, счастлив. '
                 '\nВсе во мне. \n(И. А. Бунин) \n\nМелькают мимо будки, бабы, \nМальчишки, лавки, фонари, '
                 '\nДворцы, сады, монастыри... \n(А. С. Пушкин);'
}
